Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.Placing Property
 The placing attributes of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.DimensionPlacingAttributes Placing { get; set; }
Public Property Placing As DimensionSetBaseAttributes.DimensionPlacingAttributes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.DimensionPlacingAttributes
See Also
Reference
DimensionSetBaseAttributes Class
Tekla.Structures.Drawing Namespace